InformationRegisters/DMS_СправочнаяИнформацияПоФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СправочнаяИнформацияПоФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыЗначенийФИО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/DMS_ТипыЗначенийФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыЗначенийФИО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фамилия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/DMS_СправочнаяИнформацияПоФИО/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьЗначения(Команда)
	
	Макет = ПолучитьМакетИмен();
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла(".xls");
	
	Макет.Записать(ПутьКФайлу);
	
	//Созданиеобъектадляустановкисвязисисточникомданных
	Connection =Новый COMОбъект("ADODB.Connection");
	
	//СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0; Data Source = "+ПутьКФайлу;
	//СтрокаПодключения = СтрокаПодключения+"; Extended Properties = "+"""Excel 8.0"+";HDR=NO;IMEX=1"";";
	
	СonnectionString = Новый Структура;
	// Основные.
	СonnectionString.Вставить("Jet_OLEDB_4_0_Excel_8_0"			, "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ПутьКФайлу) + ";Extended Properties=""Excel 8.0;HDR=YES;IMEX=1;""");		// XLS: Для книг Microsoft Excel 8.0 (97).
	СonnectionString.Вставить("Excel_Driver_XLS"				, "Driver={Microsoft Excel Driver (*.xls)};Dbq= " 	+ СокрЛП(ПутьКФайлу) + ";ReadOnly=1;");												// XLS: Для книг ранее Microsoft Excel 9.0 (2007).
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_12_0_XML"	, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ПутьКФайлу) + ";Extended Properties=""Excel 12.0 XML;HDR=YES;IMEX=1;""");	// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	СonnectionString.Вставить("Excel_Driver_XLSX"				, "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};Dbq=" + СокрЛП(ПутьКФайлу) + ";ReadOnly=1;");							// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	// Дополнительные.
	СonnectionString.Вставить("Jet_OLEDB_4_0_Excel_9_0"			, "Provider=Microsoft.Jet.OLEDB.4.0;Data Source= "  + СокрЛП(ПутьКФайлу) + ";Extended Properties=""Excel 9.0;HDR=YES;IMEX=1;""");		// XLS: Для книг Microsoft Excel 9.0 (2000).
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_8_0"		, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ПутьКФайлу) + ";Extended Properties=""Excel 8.0;HDR=YES;IMEX=1;""");		// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	СonnectionString.Вставить("ACE_OLEDB_12_0_Excel_12_0"		, "Provider=Microsoft.ACE.OLEDB.12.0;Data Source= " + СокрЛП(ПутьКФайлу) + ";Extended Properties=""Excel 12.0;HDR=YES;IMEX=1;""");		// XLSX: Для книг Microsoft Excel 9.0 (2007) и выше.
	
	//подключениекисточникуданных
	//Попытка
	//	Connection.Open(СтрокаПодключения);
	//Исключение
	//	
	//	Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	ЗаписьЖурналаРегистрации("Формирование справочной информации по ФИО",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	Возврат;
	//	
	//КонецПопытки;
	Для Каждого СтрокаСоединения ИЗ СonnectionString Цикл
		Попытка
			Connection.Open(СтрокаСоединения.Значение);		// Открытие соединения.
			// Импирически определенный параметр для правильного определения количества строк листа.
			//Connection.CursorLocation 	= 3;					// По-умолчанию 2.
			Прервать;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	
	//созданиеобъектавыполнениякоманды
	Command =Новый COMОбъект("ADODB.Command");
	
	//созданиеобъектаподключениякфайлу
	axCatalog =Новый COMОбъект("ADOX.Catalog");                                                
	axCatalog.ActiveConnection = Connection;
	
	счЛиста=1;
	
	Для каждого Лист ИЗ axCatalog.Tables Цикл
		
		Если счЛиста=1 Тогда
			
			ИмяТаблицы=Лист.Name; 
			
			Прервать;
			
		КонецЕсли;
		
		счЛиста=счЛиста+1;
		
	КонецЦикла;
		
	ТекстЗапросаКолонки="";
	СтрокаКолонки="";
		
	//Созданиеобъектанаборазаписей
	RecordSet =Новый COMОбъект("ADODB.RecordSet");
	
	//Указаниеактивногосоединения
	Command.ActiveConnection = Connection;
	
	//получимколичествостроквдокументе
	Command.CommandText ="SELECT COUNT(*)FROM ["+ИмяТаблицы+"]";
	
	//определениетипакоманды
	Command.CommandType =1;
	
	//Выполнениеиполучениенабораданных
	RecordSet = Command.Execute();
	
	//перваязаписьэтоколичество
	КоличествоСтрок= RecordSet.Fields(0).Value;
	
	//опредлелениетекстакоманды
	Command.CommandText ="SELECT * FROM ["+ИмяТаблицы+"]";
	
	//определениетипакоманды
	Command.CommandType =1;
	
	//Выполнениеиполучениенабораданных
	Попытка         
		RecordSet = Command.Execute();
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("Формирование справочной информации по ФИО",УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	RecordSet.MoveNext();//т.кперваястрокаэтозаголовкитаблиц,небудемееучитывать
		
	Пока RecordSet.EOF() = 0 Цикл
		
		СтрокаТабличнойЧасти = ТаблицаИменИОтчеств.Добавить();
		
		СтрокаТабличнойЧасти.Значение = СокрЛП(Строка(RecordSet.Fields(0).Value));
		СтрокаТабличнойЧасти.Тип	  = СокрЛП(Строка(RecordSet.Fields(1).Value));
		
		RecordSet.MoveNext();
		
	КонецЦикла;
	
	RecordSet.Close();
	Connection.Close();
		                                      
	ОбновитьЗначенияНаСервере();
	
	УдалитьФайлы(ПутьКФайлу);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияНаСервере()
	
	ЗагрузитьИменаИОтчества();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИменаИОтчества()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИменИОтчеств",ТаблицаИменИОтчеств.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаИменИОтчеств.Значение КАК Значение,
		|	ТаблицаИменИОтчеств.Тип КАК Тип
		|ПОМЕСТИТЬ мТаблица
		|ИЗ
		|	&ТаблицаИменИОтчеств КАК ТаблицаИменИОтчеств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	мТаблица.Значение КАК Значение,
		|	ВЫБОР
		|		КОГДА мТаблица.Тип = ""Отчество""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.DMS_ТипыЗначенийФИО.Отчество)
		|		КОГДА мТаблица.Тип = ""Имя""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.DMS_ТипыЗначенийФИО.Имя)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Тип
		|ИЗ
		|	мТаблица КАК мТаблица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.DMS_СправочнаяИнформацияПоФИО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Значение.Установить(Выборка.Значение);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла; 
	
	ТаблицаИменИОтчеств.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМакетИмен()
	
	Возврат РегистрыСведений.DMS_СправочнаяИнформацияПоФИО.ПолучитьМакет("СправочникИменИОтчества");
	
КонецФункции // ПолучитьМакетИмен()
